# Pandas - Resource for All Essential Methods and Techniques

*This notebook is for anyone who works with, or wishes to learn **Pandas**. This notebook contains most of the essential methods and techniques that you need in hand in order to, successfully and consistently, clean & manipulate data*

## Table of Contents:
<ul>
    <li><a href='#intro'>Introduction</a></li>
    <li><a href='#dfc'>DataFrame Creation</a></li>
    <li><a href='#drdg'>Creating a Dataset from Random Data Generator</a></li>
    <li><a href='#method_info'>Methods to Obtain Information from Data</a></li>
    <li><a href='#method_index'>Indexing</a></li>
    <li><a href='#method_clean'>Cleaning Data</a></li>
    <li><a href='#method_add'>Adding/Removing Rows & Columns</a></li>
    <li><a href='#method_upd'>Updating Rows & Columns</a></li>
    <li><a href='#method_filt'>Filtering Methods</a></li>
    <li><a href='#method_grp'>Grouping Methods</a></li>
</ul>

<a id='intro'></a>
## Introduction

>***Pandas*** *is a powerful, fast, and flexible Python library for Data Preparation, Cleaning and Manipulation. For more information on* ***Pandas***, *visit https://pandas.pydata.org/docs/reference/index.html*

This Jupyter notebook serves as a reference for individuals who are new to **Pandas** and wish they had a single resource they can refer to, that contains the most frequently used **Pandas** methods and how to use them. 

This notebook is also a resource for individuals to practice getting familiar with **Pandas** without having to deal with large datasets.

If you decided to learn **Pandas** I would assume that you already have basic knowledge of Python. If not, I suggest you become at least familiar with the language before attempting to learn **Pandas**. It's also important to know that this only covers **Pandas'** basic methods and techniques, advanced topics will not be covered in this notebook.

Throughout this notebook you will find me saying 'methods' a lot. There's no difference between a method and a function, except that when I'm talking about a **Pandas** built-in function, I will refer to it as 'method'.

<br>

#### Importing Packages & Libraries

In [1]:
import numpy as np
import pandas as pd
import random

There are 2 ways to create a DataFrame in **Pandas**
<ol>
    <li>Create a DataFrame from Dictionary</li>
    <strong><li>Import .csv file into DataFrame</li></strong>
</ol>

<a id='dfc'></a>
## DataFrame Creation

### 1. Create a DataFrame from Dictionary

a) you could construct a dictionary inside Pandas' **pd.DataFrame( )** method.

In [2]:
df = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220920"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
})

df

     A          B    C  D      E    F
0  1.0 2022-09-20  1.0  3   test  foo
1  1.0 2022-09-20  1.0  3  train  foo
2  1.0 2022-09-20  1.0  3   test  foo
3  1.0 2022-09-20  1.0  3  train  foo

<br>

b) you could define a dictionary, then pass the name of the dictionary as an argument in Pandas' **pd.DataFrame( )** method.

In [3]:
df_dict = {
        "A": 1.0,
        "B": pd.Timestamp("20220920"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
} 

df = pd.DataFrame(df_dict)

df

     A          B    C  D      E    F
0  1.0 2022-09-20  1.0  3   test  foo
1  1.0 2022-09-20  1.0  3  train  foo
2  1.0 2022-09-20  1.0  3   test  foo
3  1.0 2022-09-20  1.0  3  train  foo


### 2. Create a DataFrame by importing .csv file

you can create a DataFrame using Pandas' **pd.read_csv( )** method by passing the .csv file name as an argument.

In [4]:
df = pd.read_csv('./sample_df.csv')
df

     A           B    C  D      E    F
0  1.0  2022-09-20  1.0  3   test  foo
1  1.0  2022-09-20  1.0  3  train  foo
2  1.0  2022-09-20  1.0  3   test  foo
3  1.0  2022-09-20  1.0  3  train  foo

***However, it's important to know that in real-life situations you will most likely use the 'pd.read_csv( )' method more often. Because in most cases, the data you are going to analyse or manipulate will either be a .csv file pulled from a database, or a .csv file you can find on the web.***
<br>
<br>
<hr>
<br>

> The dataset we are going to use will be a generic dataset initiated from a dictionary using a **random data generator**.

<a id='drdg'></a>
### Creating a Dataset from a Random Data Generator

Below is a basic dictionary generator built to help you initiate a dataset with random values without much work.

This can be helpful when trying to learn Pandas and can't find a simple dataset to work with. Using this random data generator, you can build a simple dataset.

The code below generates a dictionary with random values, that can be transformed into a dataframe using **Pandas**.

This function will return **df.csv** which we will import into Pandas using **pd.read_csv( )** method.

> **YOU DON'T NEED TO RUN THE CODE FOR RANDOM DATA GENERATOR!!!**<br>
<br>
*the **df.csv** file that we will use to import the data into Pandas is already included in the directory that contains this Jupyter notebook.* 

However if you wish to run the code, note that this is a random data generator, which means that everytime you run the code, you will get a new & unique dataset. So if you would like to follow along with matching data, I suggest you don't run the code.

***Otherwise, feel free to run the code and use it any way you want.***

<a id='rdg'></a>
### Random Data Generator

The purpose of this function is to help you save time building datasets
when learning Pandas.
<br>
<br>
> feel free to change any values to your liking. (add or remove names, countries, 
keys from/to the dictionary etc.)

In [7]:
# !!!!! FUNCTION IS DISABLED, CHECK BOTTOM OF CELL TO ENABLE !!!!!!


def build_dict(num):
    first_name = ['Adam', 'Aaron', 'Andrew', 'Benjamin', 'Bill', 'Conrad', 'Carl',
                  'Daniel','David', 'Erik', 'Edwin', 'Evan', 'Frank', 'Frederick',
                  'Gabriel', 'Ian', 'Jack', 'John', 'Jason', 'Mark', 'Martin',
                  'Magnus', 'Neil', 'Oscar', 'Oswald', 'Patrick', 'Peter', 'Quentin', 
                  'Russel', 'Ron', 'Steven', 'Stanislas', 'Tyler', 'Victor', 'William', 'Xavier', 
                  'Amin', 'Salim']
    
    last_name = ['Morten', 'Atkinson', 'Manning', 'Stevenson', 'Eriksen', 'Robinson', 'Perreira',
                 'Flick', 'Tanner', 'Fraser', 'Lehmann', 'Hansen', 'Hassan', 'Magnusson', 'Hvar', 
                 'Kimmel', 'Ronson', 'Hamilton', 'Thomas', 'Richards', 'Terry', 'Gerard',
                 'Hank', 'Williamson', 'Roberts', 'Smith', 'Towns', 'Phillips', 'Woodburn', 'Patten', 
                 'Fernandez', 'Williams', 'Bulsic', 'Kramer', 'Mendez', 'Albert', 'Samir', 'Aygun']
    
    countries = ['USA', 'UK', 'Scotland', 'Canada', 'Australia', 'New Zealand']
    
    languages = ['html; CSS; Javascript', 'Python', 'Java', 'Dart', 'PHP', 'Ruby', 'R']
    
    names_dict = {'first_name': [],
             'last_name': [],
             'email': [],
             'age': [],
             'country': [],
             'salary': [],
             'languages': [],     
            }

    for i in range(num):
        firstname = random.choice(first_name)
        lastname = random.choice(last_name)
        email = '{}{}{}@gmail.com'.format(firstname[0].lower(), lastname.lower(), random.randint(10, 99))
        age = random.randint(25, 45)
        country = random.choice(countries)
        salary = random.randint(40, 120) * 1000
        language = random.choice(languages)
        
# Here we will create a conditional statement to ensure that there are no name duplicates
# in the dataset, this may affect the resulting number of rows in the dataset.

        if firstname in names_dict['first_name'] and lastname in names_dict['last_name']:
            continue
        
        else:
            names_dict['first_name'] += [firstname]
            names_dict['last_name'] += [lastname]
            names_dict['email'] += [email]
            names_dict['age'] += [age]
            names_dict['country'] += [country]
            names_dict['salary'] += [salary]
            names_dict['languages'] += [language]
            
        
    
    df = pd.DataFrame(names_dict)
    df.to_csv('./df.csv', index=False)
    
    return len(names_dict['first_name'])


# to control the number of values that will exist in the dictionary, you can pass 
# the number you want as an arg when calling the 'build_dict()' function,
# as demonstrated below. (default = 1000)


# !!!!!! TO ENABLE THIS FUNCTION, REMOVE '#' BELOW & RUN THE CELL !!!!!!

#build_dict(100)

**N.B**: if we run Python's ***len( )*** method on the generated dictionary, which is the return value for **build_dict( )** function. We find that the number of rows is different than the number we passed as an argument in the <a href='#rdg'>random data generator's</a> **build_dict( )** function.
<br>
<br>
This is the effect of the **if conditional** statement located in the for loop inside **build_dict( )** function, as explained <a href='#rdg'>*above*</a>

### Important Read

*After running the random data generator we can see that it generated a new **'df.csv'** file. This is the file we will be using from now on, and we will import it into **Pandas** in the next section.*
<br>

> *If you did not run the code, you can use the **'df.csv'** file located in the directory that contains this Jupyter notebook.*

### Creating DataFrame

In [9]:
df = pd.read_csv('./df.csv')
df

,first_name,last_name,email,age,country,salary,languages
0,Frank,Thomas,fthomas94@gmail.com,34,Scotland,117000,R
1,Carl,Hansen,chansen28@gmail.com,38,UK,101000,Ruby
2,Aaron,Hansen,ahansen75@gmail.com,26,Canada,92000,PHP
3,Evan,Phillips,ephillips75@gmail.com,30,Australia,51000,R
4,Benjamin,Kramer,bkramer29@gmail.com,34,Scotland,71000,Python
5,Steven,Roberts,sroberts46@gmail.com,43,Scotland,57000,Java
6,Gabriel,Fraser,gfraser84@gmail.com,37,Scotland,74000,html; CSS; Javascript
7,Andrew,Flick,aflick69@gmail.com,37,Australia,72000,html; CSS; Javascript
8,Erik,Williams,ewilliams55@gmail.com,42,Australia,65000,PHP
9,Daniel,Hank,dhank42@gmail.com,27,USA,107000,Java
10,Frederick,Kimmel,fkimmel54@gmail.com,36,UK,82000,Ruby
11,Stanislas,Williams,swilliams29@gmail.com,45,UK,71000,PHP
12,David,Eriksen,deriksen79@gmail.com,35,Australia,66000,R
13,Oscar,Samir,osamir10@gmail.com,25,New Zealand,91000,R
14,Steven,Patten,spatten89@gmail.com,25,New Zealand,73000,Dart
15,Andrew,Hassan,ahassan25@gmail.com,44,Australia,59000,R
16,Xavier,Albert,xalbert12@gmail.com,43,Australia,66000,R
17,Patrick,Patten,ppatten96@gmail.com,25,UK,72000,R
18,Ian,Gerard,igerard99@gmail.com,38,Canada,85000,PHP
19,John,Towns,jtowns14@gmail.com,38,USA,95000,Dart
20,Stanislas,Williamson,swilliamson38@gmail.com,31,UK,61000,Java
21,Amin,Hank,ahank60@gmail.com,25,USA,49000,Ruby
22,Xavier,Richards,xrichards36@gmail.com,40,Australia,46000,Dart
23,Neil,Bulsic,nbulsic77@gmail.com,31,UK,55000,Java
24,Mark,Smith,msmith94@gmail.com,32,Australia,65000,Java
25,Erik,Terry,eterry45@gmail.com,25,Scotland,71000,Ruby
26,Aaron,Ronson,aronson59@gmail.com,31,UK,40000,Java
27,Carl,Atkinson,catkinson68@gmail.com,37,Australia,105000,Java
28,William,Williamson,wwilliamson93@gmail.com,36,Scotland,92000,Java
29,Salim,Kimmel,skimmel57@gmail.com,35,Australia,120000,PHP
30,Frederick,Perreira,fperreira94@gmail.com,38,Canada,41000,Java
31,Magnus,Manning,mmanning77@gmail.com,33,USA,81000,R
32,Edwin,Hamilton,ehamilton86@gmail.com,25,New Zealand,82000,Python
33,Neil,Magnusson,nmagnusson54@gmail.com,39,UK,108000,Ruby
34,Peter,Robinson,probinson48@gmail.com,29,USA,109000,Ruby
35,Peter,Tanner,ptanner12@gmail.com,36,New Zealand,68000,PHP
36,Jack,Patten,jpatten95@gmail.com,30,New Zealand,73000,html; CSS; Javascript
37,Jason,Terry,jterry59@gmail.com,39,Scotland,59000,Python
38,Conrad,Williams,cwilliams60@gmail.com,36,UK,99000,html; CSS; Javascript
39,Martin,Eriksen,meriksen65@gmail.com,28,USA,119000,Python
40,Andrew,Fernandez,afernandez67@gmail.com,33,USA,100000,Java
41,Andrew,Hvar,ahvar56@gmail.com,42,USA,40000,Python
42,Russel,Woodburn,rwoodburn12@gmail.com,25,New Zealand,42000,Ruby
43,John,Stevenson,jstevenson63@gmail.com,26,Australia,111000,Ruby
44,Quentin,Mendez,qmendez82@gmail.com,45,UK,113000,Dart
45,Carl,Aygun,caygun41@gmail.com,43,Scotland,82000,Dart
46,Adam,Flick,aflick49@gmail.com,32,Canada,62000,R
47,Frank,Morten,fmorten39@gmail.com,32,Australia,54000,R
48,Bill,Williams,bwilliams16@gmail.com,45,UK,110000,R
49,Tyler,Eriksen,teriksen52@gmail.com,27,USA,50000,Dart
50,Victor,Magnusson,vmagnusson39@gmail.com,32,Canada,75000,Java
51,Mark,Lehmann,mlehmann74@gmail.com,34,Scotland,41000,R
52,Ron,Stevenson,rstevenson80@gmail.com,40,Australia,112000,Python
53,Oswald,Gerard,ogerard55@gmail.com,25,UK,69000,Ruby

<hr>
<br>

<a id='method_info'></a>
### Methods to obtain information from data

> Now that the data is loaded, I am going to point out the general and most used methods in **Pandas**. As well as explain the purpose of every method.
<br>
<br>
**You can find all the methods at** https://pandas.pydata.org/docs/reference/frame.html

In [10]:
df.info()     # Returns a concise summary of the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  54 non-null     object
 1   last_name   54 non-null     object
 2   email       54 non-null     object
 3   age         54 non-null     int64
 4   country     54 non-null     object
 5   salary      54 non-null     int64
 6   languages   54 non-null     object
dtypes: int64(2), object(5)
memory usage: 3.1+ KB

In [11]:
df.head()     # Returns the first 5 rows (You can pass the number of rows you want as arg)

,first_name,last_name,email,age,country,salary,languages
0,Frank,Thomas,fthomas94@gmail.com,34,Scotland,117000,R
1,Carl,Hansen,chansen28@gmail.com,38,UK,101000,Ruby
2,Aaron,Hansen,ahansen75@gmail.com,26,Canada,92000,PHP
3,Evan,Phillips,ephillips75@gmail.com,30,Australia,51000,R
4,Benjamin,Kramer,bkramer29@gmail.com,34,Scotland,71000,Python

In [12]:
df.tail()     # Returns the last 5 rows (You can pass the number of rows you want as arg)

,first_name,last_name,email,age,country,salary,languages
49,Tyler,Eriksen,teriksen52@gmail.com,27,USA,50000,Dart
50,Victor,Magnusson,vmagnusson39@gmail.com,32,Canada,75000,Java
51,Mark,Lehmann,mlehmann74@gmail.com,34,Scotland,41000,R
52,Ron,Stevenson,rstevenson80@gmail.com,40,Australia,112000,Python
53,Oswald,Gerard,ogerard55@gmail.com,25,UK,69000,Ruby

In [13]:
df.max()     # Returns maximum values for columns in DataFrame

first_name                   Xavier
last_name                  Woodburn
email         xrichards36@gmail.com
age                              45
country                         USA
salary                       120000
languages     html; CSS; Javascript
dtype: object

In [14]:
df.min()     # Returns minimum values for columns in DataFrame

first_name                     Aaron
last_name                     Albert
email         afernandez67@gmail.com
age                               25
country                    Australia
salary                         40000
languages                       Dart
dtype: object

In [15]:
df.shape     # Returns a tuple representing the dimensions of the DataFrame

(54, 7)

In [16]:
df.dtypes     # Returns data types of columns in DataFrame

first_name    object
last_name     object
email         object
age            int64
country       object
salary         int64
languages     object
dtype: object

In [17]:
df.describe()     # Returns descriptive statistics on DataFrame

             age         salary
count  54.000000      54.000000
mean   34.055556   77240.740741
std     6.259835   23586.000953
min    25.000000   40000.000000
25%    29.250000   59500.000000
50%    34.000000   72500.000000
75%    38.000000   98000.000000
max    45.000000  120000.000000

In [18]:
df.duplicated().sum()     # Returns sum of duplicate rows

0

In [19]:
df.isna().sum()      # Returns sum of missing values

first_name    0
last_name     0
email         0
age           0
country       0
salary        0
languages     0
dtype: int64

In [20]:
df.isnull().sum()     # Returns sum of missing values

first_name    0
last_name     0
email         0
age           0
country       0
salary        0
languages     0
dtype: int64

> *These are the most common methods you will use to obtain preliminary information about the DataFrame.*

<br>
<br>
<hr>

<a id='method_index'></a>
### Indexing

> In this section, I will demonstrate how to index specific columns from the DataFrame and the methods that can be applied to those columns.

#### 1. Indexing Columns

In [21]:
df['email']     # Returns values for selected column

0         fthomas94@gmail.com
1         chansen28@gmail.com
2         ahansen75@gmail.com
3       ephillips75@gmail.com
4         bkramer29@gmail.com
5        sroberts46@gmail.com
6         gfraser84@gmail.com
7          aflick69@gmail.com
8       ewilliams55@gmail.com
9           dhank42@gmail.com
10        fkimmel54@gmail.com
11      swilliams29@gmail.com
12       deriksen79@gmail.com
13         osamir10@gmail.com
14        spatten89@gmail.com
15        ahassan25@gmail.com
16        xalbert12@gmail.com
17        ppatten96@gmail.com
18        igerard99@gmail.com
19         jtowns14@gmail.com
20    swilliamson38@gmail.com
21          ahank60@gmail.com
22      xrichards36@gmail.com
23        nbulsic77@gmail.com
24         msmith94@gmail.com
25         eterry45@gmail.com
26        aronson59@gmail.com
27      catkinson68@gmail.com
28    wwilliamson93@gmail.com
29        skimmel57@gmail.com
30      fperreira94@gmail.com
31       mmanning77@gmail.com
32      ehamilton86@gmail.com
33     nmagnusson54@gmail.com
34      probinson48@gmail.com
35        ptanner12@gmail.com
36        jpatten95@gmail.com
37         jterry59@gmail.com
38      cwilliams60@gmail.com
39       meriksen65@gmail.com
40     afernandez67@gmail.com
41          ahvar56@gmail.com
42      rwoodburn12@gmail.com
43     jstevenson63@gmail.com
44        qmendez82@gmail.com
45         caygun41@gmail.com
46         aflick49@gmail.com
47        fmorten39@gmail.com
48      bwilliams16@gmail.com
49       teriksen52@gmail.com
50     vmagnusson39@gmail.com
51       mlehmann74@gmail.com
52     rstevenson80@gmail.com
53        ogerard55@gmail.com
Name: email, dtype: object

In [22]:
df[['last_name', 'email', 'salary']]

# Returns a DataFrame from selected columns. Note that when accessing multiple columns
# you have to pass column names as a list.

     last_name                    email  salary
0       Thomas      fthomas94@gmail.com  117000
1       Hansen      chansen28@gmail.com  101000
2       Hansen      ahansen75@gmail.com   92000
3     Phillips    ephillips75@gmail.com   51000
4       Kramer      bkramer29@gmail.com   71000
5      Roberts     sroberts46@gmail.com   57000
6       Fraser      gfraser84@gmail.com   74000
7        Flick       aflick69@gmail.com   72000
8     Williams    ewilliams55@gmail.com   65000
9         Hank        dhank42@gmail.com  107000
10      Kimmel      fkimmel54@gmail.com   82000
11    Williams    swilliams29@gmail.com   71000
12     Eriksen     deriksen79@gmail.com   66000
13       Samir       osamir10@gmail.com   91000
14      Patten      spatten89@gmail.com   73000
15      Hassan      ahassan25@gmail.com   59000
16      Albert      xalbert12@gmail.com   66000
17      Patten      ppatten96@gmail.com   72000
18      Gerard      igerard99@gmail.com   85000
19       Towns       jtowns14@gmail.com   95000
20  Williamson  swilliamson38@gmail.com   61000
21        Hank        ahank60@gmail.com   49000
22    Richards    xrichards36@gmail.com   46000
23      Bulsic      nbulsic77@gmail.com   55000
24       Smith       msmith94@gmail.com   65000
25       Terry       eterry45@gmail.com   71000
26      Ronson      aronson59@gmail.com   40000
27    Atkinson    catkinson68@gmail.com  105000
28  Williamson  wwilliamson93@gmail.com   92000
29      Kimmel      skimmel57@gmail.com  120000
30    Perreira    fperreira94@gmail.com   41000
31     Manning     mmanning77@gmail.com   81000
32    Hamilton    ehamilton86@gmail.com   82000
33   Magnusson   nmagnusson54@gmail.com  108000
34    Robinson    probinson48@gmail.com  109000
35      Tanner      ptanner12@gmail.com   68000
36      Patten      jpatten95@gmail.com   73000
37       Terry       jterry59@gmail.com   59000
38    Williams    cwilliams60@gmail.com   99000
39     Eriksen     meriksen65@gmail.com  119000
40   Fernandez   afernandez67@gmail.com  100000
41        Hvar        ahvar56@gmail.com   40000
42    Woodburn    rwoodburn12@gmail.com   42000
43   Stevenson   jstevenson63@gmail.com  111000
44      Mendez      qmendez82@gmail.com  113000
45       Aygun       caygun41@gmail.com   82000
46       Flick       aflick49@gmail.com   62000
47      Morten      fmorten39@gmail.com   54000
48    Williams    bwilliams16@gmail.com  110000
49     Eriksen     teriksen52@gmail.com   50000
50   Magnusson   vmagnusson39@gmail.com   75000
51     Lehmann     mlehmann74@gmail.com   41000
52   Stevenson   rstevenson80@gmail.com  112000
53      Gerard      ogerard55@gmail.com   69000

> *Indexing allows you to run some of the general methods discussed earlier on the specified column(s) you've indexed.*

In [23]:
df['age'].max()     # Returns maximum value for selected column

45

In [24]:
df['salary'].min()     # Returns minimum value for selected column

40000

In [25]:
df['country'].unique()     # Returns unique values for selected column

array(['Scotland', 'UK', 'Canada', 'Australia', 'USA', 'New Zealand'],
      dtype=object)

In [26]:
df['languages'].value_counts()

# Returns Series with count of unique values in specified column

R                        12
Java                     11
Ruby                      9
PHP                       6
Python                    6
Dart                      6
html; CSS; Javascript     4
Name: languages, dtype: int64

<br>

#### 2. Indexing Rows

> To access values for a specific row, we use **.iloc** and **.loc** methods.
<br>
<br>
**.iloc** and **.loc** are similar methods. The only difference is that **.iloc** takes *integers* as arguments, while **.loc** can take *integers or strings* as arguments

In [27]:
df.iloc[38]     # Returns values for selected row index

first_name                   Conrad
last_name                  Williams
email         cwilliams60@gmail.com
age                              36
country                          UK
salary                        99000
languages     html; CSS; Javascript
Name: 38, dtype: object

In [28]:
df.iloc[0, 1]     # Returns value for selected row & specified column

'Thomas'

In [29]:
df.iloc[[0, 23]]     # Returns DataFrame with values for selected rows

   first_name last_name                email  age   country  salary languages
0       Frank    Thomas  fthomas94@gmail.com   34  Scotland  117000         R
23       Neil    Bulsic  nbulsic77@gmail.com   31        UK   55000      Java

In [30]:
df.iloc[[0, 11], 2]     # Returns values for selected rows in a specific column

0       fthomas94@gmail.com
11    swilliams29@gmail.com
Name: email, dtype: object

In [31]:
df.loc[[0, 32]]     # Returns DataFrame values for selected rows

,first_name,last_name,email,age,country,salary,languages
0,Frank,Thomas,fthomas94@gmail.com,34,Scotland,117000,R
32,Edwin,Hamilton,ehamilton86@gmail.com,25,New Zealand,82000,Python

In [32]:
df.loc[0, 'last_name']     # Returns value for selected row & specified column

'Thomas'

In [33]:
df.loc[0:8, ['email', 'last_name']]

# Returns DataFrame with values for index range & specified columns

                   email last_name
0    fthomas94@gmail.com    Thomas
1    chansen28@gmail.com    Hansen
2    ahansen75@gmail.com    Hansen
3  ephillips75@gmail.com  Phillips
4    bkramer29@gmail.com    Kramer
5   sroberts46@gmail.com   Roberts
6    gfraser84@gmail.com    Fraser
7     aflick69@gmail.com     Flick
8  ewilliams55@gmail.com  Williams

> Those are the most common methods for indexing rows and columns in **Pandas**.

<a id='method_add'></a>
### Adding/Removing Rows and Columns

#### 1. Methods for Adding/Removing Rows

>If you wish to add a row to a DataFrame, you can use the **df.append( )** method

In [34]:
df = df.append({
        'first_name': 'Karim',
        'last_name': 'Carlson',

}, ignore_index=True)

# You can append values to a DataFrame by passing a dictionary where dictionary keys 
# and values correspond to column names and the values you want to append to the DataFrame.
# Assign 'df.append()' method to 'df' variable.

# Remember to pass 'ignore_index=True' or else you will get an Error.

In [35]:
df.tail()

,first_name,last_name,email,age,country,salary,languages
50,Victor,Magnusson,vmagnusson39@gmail.com,32.0,Canada,75000.0,Java
51,Mark,Lehmann,mlehmann74@gmail.com,34.0,Scotland,41000.0,R
52,Ron,Stevenson,rstevenson80@gmail.com,40.0,Australia,112000.0,Python
53,Oswald,Gerard,ogerard55@gmail.com,25.0,UK,69000.0,Ruby
54,Karim,Carlson,NaN,NaN,NaN,NaN,NaN

> Now we can confirm that the DataFrame has been updated. We can see that the other columns show 'NaN' values, because we did not pass values for those columns.

To remove the row that has been created we will use **df.drop( )** method.

In [36]:
df.drop(49, inplace=True)

Now we check to see if the row has actually been removed

In [40]:
df.tail()

,first_name,last_name,email,age,country,salary,languages
50,Victor,Magnusson,vmagnusson39@gmail.com,32.0,Canada,75000.0,Java
51,Mark,Lehmann,mlehmann74@gmail.com,34.0,Scotland,41000.0,R
52,Ron,Stevenson,rstevenson80@gmail.com,40.0,Australia,112000.0,Python
53,Oswald,Gerard,ogerard55@gmail.com,25.0,UK,69000.0,Ruby
54,Karim,Carlson,NaN,NaN,NaN,NaN,NaN

>*We have successfully removed the new row that has been created.*

<br>

#### 2. Methods for Adding/Removing Columns

In [41]:
df.head(2)

,first_name,last_name,email,age,country,salary,languages
0,Frank,Thomas,fthomas94@gmail.com,34.0,Scotland,117000.0,R
1,Carl,Hansen,chansen28@gmail.com,38.0,UK,101000.0,Ruby

*We add a new column by passing the new column name is an index of the DataFrame and assign an operation to it, as demonstrated below.*

In [45]:
df['monthly_salary'] = (df['salary'] / 12)
df.head()

,first_name,last_name,email,age,country,salary,languages,monthly_salary
0,Frank,Thomas,fthomas94@gmail.com,34.0,Scotland,117000.0,R,9750.000000
1,Carl,Hansen,chansen28@gmail.com,38.0,UK,101000.0,Ruby,8416.666667
2,Aaron,Hansen,ahansen75@gmail.com,26.0,Canada,92000.0,PHP,7666.666667
3,Evan,Phillips,ephillips75@gmail.com,30.0,Australia,51000.0,R,4250.000000
4,Benjamin,Kramer,bkramer29@gmail.com,34.0,Scotland,71000.0,Python,5916.666667

<br>

*To remove the column we just created, we can use **df.drop( )** method.*

In [46]:
df.drop(columns='monthly_salary', inplace=True)
df.head()

,first_name,last_name,email,age,country,salary,languages
0,Frank,Thomas,fthomas94@gmail.com,34.0,Scotland,117000.0,R
1,Carl,Hansen,chansen28@gmail.com,38.0,UK,101000.0,Ruby
2,Aaron,Hansen,ahansen75@gmail.com,26.0,Canada,92000.0,PHP
3,Evan,Phillips,ephillips75@gmail.com,30.0,Australia,51000.0,R
4,Benjamin,Kramer,bkramer29@gmail.com,34.0,Scotland,71000.0,Python

>*We have successfully removed the column 'monthly_salary'*

<a id='method_upd'></a>
### Updating Rows & Columns

#### 1. Methods for Updating Columns

In [47]:
df.columns     # Returns list with column names

Index(['first_name', 'last_name', 'email', 'age', 'country', 'salary',
       'languages'],
      dtype='object')

> Below are 3 different ways to rename columns

In [48]:
df.columns = [x.upper() for x in df.columns]

# Applies .upper() on all columns 

df.columns

Index(['FIRST_NAME', 'LAST_NAME', 'EMAIL', 'AGE', 'COUNTRY', 'SALARY',
       'LANGUAGES'],
      dtype='object')

In [49]:
df.rename(columns={'FIRST_NAME': 'First_Name'}, inplace=True)

# This is used to rename only the values you pass in {'Column_Name': 'New_Column_Name'} 

df.columns

Index(['First_Name', 'LAST_NAME', 'EMAIL', 'AGE', 'COUNTRY', 'SALARY',
       'LANGUAGES'],
      dtype='object')

In [50]:
df.rename(columns= lambda x: x.lower(), inplace=True)

# Rename columns using lambda function

df.columns

Index(['first_name', 'last_name', 'email', 'age', 'country', 'salary',
       'languages'],
      dtype='object')

<br>

#### 2. Methods for Updating Rows

> *You can use **.loc** method to re-assign values within the specified row, as demonstrated below.*

In [51]:
df.loc[3, ['first_name', 'last_name', 'email', 'age']] = ['Aziz', 'Ansari', 'aansari@gmail.com', 40]

# Specify row and and columns where you want to change values using .loc method
# by passing row index and list of column names you wish to re-assign.

df.loc[3]

first_name                 Aziz
last_name                Ansari
email         aansari@gmail.com
age                        40.0
country               Australia
salary                  51000.0
languages                     R
Name: 3, dtype: object

In [52]:
df.head(4)

,first_name,last_name,email,age,country,salary,languages
0,Frank,Thomas,fthomas94@gmail.com,34.0,Scotland,117000.0,R
1,Carl,Hansen,chansen28@gmail.com,38.0,UK,101000.0,Ruby
2,Aaron,Hansen,ahansen75@gmail.com,26.0,Canada,92000.0,PHP
3,Aziz,Ansari,aansari@gmail.com,40.0,Australia,51000.0,R

>As you can see, row index 3 values have changed.

*These are the methods for updating rows and columns in **Pandas**.*

<a id='method_filt'></a>
### Filtering Methods

> In this part, I will demonstrate how to create filters to help you pick specific values from the DataFrame.

In [55]:
df[df['last_name'] == 'Kimmel']

# Returns all rows where 'last_name' is 'Manning'

,first_name,last_name,email,age,country,salary,languages
10,Frederick,Kimmel,fkimmel54@gmail.com,36.0,UK,82000.0,Ruby
29,Salim,Kimmel,skimmel57@gmail.com,35.0,Australia,120000.0,PHP

In [56]:
df[df['salary'] > 100000]

# Returns all rows where 'salary' is less than 100,000

,first_name,last_name,email,age,country,salary,languages
0,Frank,Thomas,fthomas94@gmail.com,34.0,Scotland,117000.0,R
1,Carl,Hansen,chansen28@gmail.com,38.0,UK,101000.0,Ruby
9,Daniel,Hank,dhank42@gmail.com,27.0,USA,107000.0,Java
27,Carl,Atkinson,catkinson68@gmail.com,37.0,Australia,105000.0,Java
29,Salim,Kimmel,skimmel57@gmail.com,35.0,Australia,120000.0,PHP
33,Neil,Magnusson,nmagnusson54@gmail.com,39.0,UK,108000.0,Ruby
34,Peter,Robinson,probinson48@gmail.com,29.0,USA,109000.0,Ruby
39,Martin,Eriksen,meriksen65@gmail.com,28.0,USA,119000.0,Python
43,John,Stevenson,jstevenson63@gmail.com,26.0,Australia,111000.0,Ruby
44,Quentin,Mendez,qmendez82@gmail.com,45.0,UK,113000.0,Dart
48,Bill,Williams,bwilliams16@gmail.com,45.0,UK,110000.0,R
52,Ron,Stevenson,rstevenson80@gmail.com,40.0,Australia,112000.0,Python

In [57]:
df[df['age'] <= 27]

# Returns all rows where 'age' is less than or equal to 27

,first_name,last_name,email,age,country,salary,languages
2,Aaron,Hansen,ahansen75@gmail.com,26.0,Canada,92000.0,PHP
9,Daniel,Hank,dhank42@gmail.com,27.0,USA,107000.0,Java
13,Oscar,Samir,osamir10@gmail.com,25.0,New Zealand,91000.0,R
14,Steven,Patten,spatten89@gmail.com,25.0,New Zealand,73000.0,Dart
17,Patrick,Patten,ppatten96@gmail.com,25.0,UK,72000.0,R
21,Amin,Hank,ahank60@gmail.com,25.0,USA,49000.0,Ruby
25,Erik,Terry,eterry45@gmail.com,25.0,Scotland,71000.0,Ruby
32,Edwin,Hamilton,ehamilton86@gmail.com,25.0,New Zealand,82000.0,Python
42,Russel,Woodburn,rwoodburn12@gmail.com,25.0,New Zealand,42000.0,Ruby
43,John,Stevenson,jstevenson63@gmail.com,26.0,Australia,111000.0,Ruby
53,Oswald,Gerard,ogerard55@gmail.com,25.0,UK,69000.0,Ruby

In [66]:
df['last_name'].value_counts()

Williams      4
Patten        3
Gerard        2
Magnusson     2
Terry         2
Hansen        2
Flick         2
Hank          2
Kimmel        2
Eriksen       2
Stevenson     2
Williamson    2
Robinson      1
Tanner        1
Fernandez     1
Thomas        1
Hvar          1
Woodburn      1
Manning       1
Mendez        1
Aygun         1
Morten        1
Lehmann       1
Hamilton      1
Bulsic        1
Perreira      1
Atkinson      1
Ronson        1
Smith         1
Richards      1
Towns         1
Albert        1
Hassan        1
Samir         1
Fraser        1
Roberts       1
Kramer        1
Ansari        1
Carlson       1
Name: last_name, dtype: int64

> This method passes a boolean on the DataFrame and only returns values that are True.

Another method can be used to return values where two cases are evaluated. It is denoted by **&** for 'and', and **|** for 'or', as demonstrated below.

In [76]:
df[(df['last_name'] == 'Patten') & (df['first_name'] == 'Steven')]

# Returns rows where last name is Patten AND first is Steven

,first_name,last_name,email,age,country,salary,languages
14,Steven,Patten,spatten89@gmail.com,25.0,New Zealand,73000.0,Dart

In [77]:
df[(df['last_name'] == 'Williams') | (df['first_name'] == 'Benjamin')]

# Returns rows where last name is Williams OR first name is Benjamin

,first_name,last_name,email,age,country,salary,languages
4,Benjamin,Kramer,bkramer29@gmail.com,34.0,Scotland,71000.0,Python
8,Erik,Williams,ewilliams55@gmail.com,42.0,Australia,65000.0,PHP
11,Stanislas,Williams,swilliams29@gmail.com,45.0,UK,71000.0,PHP
38,Conrad,Williams,cwilliams60@gmail.com,36.0,UK,99000.0,html; CSS; Javascript
48,Bill,Williams,bwilliams16@gmail.com,45.0,UK,110000.0,R

> The same result can be achieved using **.loc** method, as demonstrated below.

In [78]:
df.loc[(df['last_name'] == 'Patten') & (df['first_name'] == 'Steven')]

# Returns rows where last name is Patten AND first is Steven

,first_name,last_name,email,age,country,salary,languages
14,Steven,Patten,spatten89@gmail.com,25.0,New Zealand,73000.0,Dart

In [79]:
df.loc[(df['last_name'] == 'Williams') | (df['first_name'] == 'Benjamin')]

# Returns rows where last name is Williams OR first is Benjamin

,first_name,last_name,email,age,country,salary,languages
4,Benjamin,Kramer,bkramer29@gmail.com,34.0,Scotland,71000.0,Python
8,Erik,Williams,ewilliams55@gmail.com,42.0,Australia,65000.0,PHP
11,Stanislas,Williams,swilliams29@gmail.com,45.0,UK,71000.0,PHP
38,Conrad,Williams,cwilliams60@gmail.com,36.0,UK,99000.0,html; CSS; Javascript
48,Bill,Williams,bwilliams16@gmail.com,45.0,UK,110000.0,R


<br>

<a id='method_grp'></a>
### Grouping Methods

>*In **Pandas** we can group different column values by another column or columns in order to get a specific result. To group different columns we use **.groupby( )** method.*

We want to get the average salary by country. To achieve that, we will group the column 'salary' by 'country' and call the **.mean( )** method.<br><br>
There are two ways to use the **.groupby( )** method, as demonstrated below

In [80]:
df['salary'].groupby(df['country']).mean()

country
Australia      76307.692308
Canada         71000.000000
New Zealand    71500.000000
Scotland       73777.777778
UK             81750.000000
USA            87500.000000
Name: salary, dtype: float64

In [81]:
df.groupby('country')['salary'].mean()

country
Australia      76307.692308
Canada         71000.000000
New Zealand    71500.000000
Scotland       73777.777778
UK             81750.000000
USA            87500.000000
Name: salary, dtype: float64

> *Both ways are identical and return the same Series.*
<br>
<br>
***This returns a Series that contains average salary for every country.***

Let's say that you want to get the number of programming languages for every country. To achieve that, we will group the column 'languages' by 'country' and call the **.value_counts( )** method.

In [82]:
df.groupby('country')['languages'].value_counts()

country      languages
Australia    R                        5
             Java                     2
             PHP                      2
             Dart                     1
             Python                   1
             Ruby                     1
             html; CSS; Javascript    1
Canada       Java                     2
             PHP                      2
             R                        1
New Zealand  Dart                     1
             PHP                      1
             Python                   1
             R                        1
             Ruby                     1
             html; CSS; Javascript    1
Scotland     Java                     2
             Python                   2
             R                        2
             Dart                     1
             Ruby                     1
             html; CSS; Javascript    1
UK           Ruby                     4
             Java                     3
             R                        2
             Dart                     1
             PHP                      1
             html; CSS; Javascript    1
USA          Java                     2
             Python                   2
             Ruby                     2
             Dart                     1
             R                        1
Name: languages, dtype: int64

In [83]:
df['languages'].groupby(df['country']).value_counts()

country      languages
Australia    R                        5
             Java                     2
             PHP                      2
             Dart                     1
             Python                   1
             Ruby                     1
             html; CSS; Javascript    1
Canada       Java                     2
             PHP                      2
             R                        1
New Zealand  Dart                     1
             PHP                      1
             Python                   1
             R                        1
             Ruby                     1
             html; CSS; Javascript    1
Scotland     Java                     2
             Python                   2
             R                        2
             Dart                     1
             Ruby                     1
             html; CSS; Javascript    1
UK           Ruby                     4
             Java                     3
             R                        2
             Dart                     1
             PHP                      1
             html; CSS; Javascript    1
USA          Java                     2
             Python                   2
             Ruby                     2
             Dart                     1
             R                        1
Name: languages, dtype: int64

>***as mentioned earlier, both methods return the same Series.***

*Now let's say you wanted to get a breakdown for languages in a specific country. The same principle for **.groupby( )** method can be applied. I will demonstrate 3 different ways by which you can get the same result.*

***Method 1: By applying a filter***<br>
if you want to refresh your memory on filtering, click <a href='#method_filt'>here</a>
<br>
<br>
*We will create a filter for **'country'** and call **.value_counts( )** on that filter.*

In [84]:
df[df['country'] == 'Australia']['languages'].value_counts()

R                        5
PHP                      2
Java                     2
html; CSS; Javascript    1
Dart                     1
Ruby                     1
Python                   1
Name: languages, dtype: int64

<br>

***Method 2: Using .groupby( ) method and .loc( ) to specify for which value we would like to group our data.***<br>
<br>
*We will group the **'country'** column by **'languages'** and call the **.value_counts( )** method, while passing country name in **.loc( )** method to return values where country name is in **'country'** column.*

In [85]:
df.groupby('country')['languages'].value_counts().loc['Australia']

languages
R                        5
Java                     2
PHP                      2
Dart                     1
Python                   1
Ruby                     1
html; CSS; Javascript    1
Name: languages, dtype: int64

<br>

***Method 3: Using .groupby( ) method to create a group for countries, then create separate country group variables using .get_group( ) method for each country we would like to pull data for.***<br>
<br>
*After creating separate variables for country groups, we can call **.value_counts( )** method.*

In [86]:
group_country = df.groupby('country')
aus = group_country.get_group('Australia')

aus['languages'].value_counts()

R                        5
PHP                      2
Java                     2
html; CSS; Javascript    1
Dart                     1
Ruby                     1
Python                   1
Name: languages, dtype: int64

<br>

***Here's another simpler demonstration for the 3 methods***

In [87]:
df[df['country'] == 'Scotland']['age'].mean()     # Using Filtering method.

36.111111111111114

In [88]:
df.groupby('country')['age'].mean().loc['Scotland']     # Using .groupby() & .loc

36.111111111111114

In [89]:
scot_group = df.groupby('country').get_group('Scotland')     # Using .groupby() & get_group()
scot_group['age'].mean()

36.111111111111114

> *These are the most common methods for grouping different column values together.* 
<br>

<br>
<br>
By now we have covered all the introductory basic methods and techniques you need to know in order to manipulate datasets and retrieve the information you are seeking from the dataset.
<br>

<br>
<br>

>***As always, feel free to change anything you want to in order to make this notebook work the best for you. You can also use & copy any code you want. 
<br>
<br>
I do not own the concepts included in this notebook, you can find it anywhere online. 
<br>
<br>
The purpose of this notebook is to collect all the information in one place, so that whoever needs a single document to refer to when using Pandas, they have this notebook ready.***